###############################################################################
# Created by write_sdc
# Wed Nov  2 14:05:27 2022
###############################################################################
current_design ldoInst
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 1000.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {core_clock}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
